Autodesk.Navisworks.Api.GridSystem
A system of grid lines and levels

Autodesk.Navisworks.Api.GridSystem.ClosestIntersection(Autodesk.Navisworks.Api.Point3D)
Returns the location closest to a given 3D point.
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.ArgumentNullException:
Argument 'point' is null
Throws System.ArgumentException:
Argument 'point' has been Disposed

Autodesk.Navisworks.Api.GridSystem.DisplayName
Name of GridSystem as diplayed in the GUI.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridSystem.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.GridSystem.Levels
Accesses Grid Levels contained in this System.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridSystem.Lines
Accesses Grid Lines contained in this System.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridSystem.LockedLevel
Determines if the GridSystem is locked to a particular level
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only
Throws System.ArgumentException:
Argument 'level' has been Disposed

Autodesk.Navisworks.Api.GridSystem.Origin
Accesses origin point of this System.
Throws System.ObjectDisposedException:
Object has been Disposed

Autodesk.Navisworks.Api.GridSystem.UpDirection
Accesses up direction of this System.
Throws System.ObjectDisposedException:
Object has been Disposed